src/DataProcessors/УдалитьПодборПеремещение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<DataProcessor>
		<Properties>
			<Name>УдалитьПодборПеремещение</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПеремещениеЗапасов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьНаборыКомплекты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиницаОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиницаПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНоменклатуры</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УникальныйИдентификаторФормыВладельца</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПереходаНаНДС20</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КорзинаОстатокРезервХарактеристика</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентСкидкиНаценки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Резерв</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтранаПроисхождения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоНабор</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/АналогиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>АналогиНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ВидыОтборовНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВидыОтборовНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ГруппыНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КатегорииНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СегментыНоменклатуры</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыОперацийПеремещениеЗапасов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПеремещениеЗапасов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеНаРасходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаВЭксплуатацию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратИзЭксплуатации</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыСтруктурныхЕдиниц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ТипыСтруктурныхЕдиниц</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Склад</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Розница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РозницаСуммовойУчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МагазинГруппаСкладов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подразделение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/DataProcessors/УдалитьПодборПеремещение/Forms/КорзинаОстатокРезервХарактеристика_МК/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - обработчик события ПриСозданииНаСервере
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Перем СведенияОДокументе;
	
	Объект.ДатаПереходаНаНДС20 = Дата('20190101');
	
	Обработки.ПодборПеремещение.ПроверитьЗаполнениеПараметров(Параметры, Отказ);
	
	ЗаполнитьДанныеОбъекта();
	ЗаполнитьСведенияОДокументе(СведенияОДокументе);
	
	ПодключитьПолнотекстовыйПоискПриОткрытииПодбора();
	УстановитьПараметрыДинамическихСписков();
	
	КешНастройкиПодбора = Новый Структура;
	КешНастройкиПодбора.Вставить("ВыводитьСоветВернутьсяКНоменклатуре", УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеНастройки("ВыводитьСоветВернутьсяКНоменклатуре"));
	КешНастройкиПодбора.Вставить("ВыводитьСоветИспользоватьПредыдущийПодбор", УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеНастройки("ВыводитьСоветИспользоватьПредыдущийПодбор"));
	КешНастройкиПодбора.Вставить("ЗапрашиватьКоличество", УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеНастройки("ЗапрашиватьКоличество"));
	КешНастройкиПодбора.Вставить("ТекущийПользователь", Пользователи.АвторизованныйПользователь());
	КешНастройкиПодбора.Вставить("СведенияОДокументе", СведенияОДокументе);
	КешНастройкиПодбора.Вставить("ПоискВыполненПриОкончанииРедактирования", Ложь);
	
	ВзаимноИсключаемыеНастройкиПП = Новый Структура;
	ВзаимноИсключаемыеНастройкиПП.Вставить("ФормаПолнотекстовыйПоискЛюбыеОкончания",	"ФормаПолнотекстовыйПоискОпечатки");
	ВзаимноИсключаемыеНастройкиПП.Вставить("ФормаПолнотекстовыйПоискОпечатки", 		"ФормаПолнотекстовыйПоискЛюбыеОкончания");
	КешНастройкиПодбора.Вставить("ВзаимноИсключаемыеНастройкиПП", ВзаимноИсключаемыеНастройкиПП);
	
	ОтборИерархия = КатегорииНоменклатурыСервер.ПолучитьНастройкуВидОтбораНоменклатуры();
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаПолнотекстовыйПоискЛюбыеОкончания", "Пометка", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокИерархияНоменклатуры", "Видимость", ОтборИерархия = Перечисления.ВидыОтборовНоменклатуры.ГруппыНоменклатуры);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокИерархияНоменклатурныхГрупп", "Видимость", ОтборИерархия = Перечисления.ВидыОтборовНоменклатуры.КатегорииНоменклатуры);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПолнотекстовыйПоиск", "Видимость", ИспользоватьПолнотекстовыйПоиск);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаАвтоСбросОтбораСписков", "Пометка", Истина);
	
	УстановитьСвойстваЭлементовФормы();
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
// Процедура - обработчик события ПриСозданииНаСервере
//
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("ВыводитьСоветИспользоватьПредыдущийПодбор", 1.5, Истина); // Из-за особенности поведения платформы делаем через обработчик
	
КонецПроцедуры // ПриОткрытии()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Процедура - обработчик события ПриИзменении реквизита ТекстПоиска
//
Процедура ТекстПоискаПриИзменении(Элемент)
	
	Если ПустаяСтрока(ТекстПоиска) Тогда
		
		СброситьОтборПоДинамическомуСписку();
		
	Иначе
		
		ВыполнитьПоискИУстановитьОтбор();
		КешНастройкиПодбора.ПоискВыполненПриОкончанииРедактирования = Истина;
		
	КонецЕсли;
	
КонецПроцедуры // ТекстПоискаПриИзменении()

&НаКлиенте
// Процедура - обработчик события Очистка реквизита ТекстПоиска
//
Процедура ТекстПоискаОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СброситьОтборПоДинамическомуСписку()
	
КонецПроцедуры // ТекстПоискаОчистка()

&НаКлиенте
// Процедура - обработчик события ПриИзменении реквизита НоменклатураИмеетсяВНаличии
//
Процедура НоменклатураИмеетсяВНаличииПриИзменении(Элемент)
	
	ВключитьВыключитьОтборНоменклатурыВНаличии();
	
КонецПроцедуры // НоменклатураИмеетсяВНаличииПриИзменении()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокЗапасы

&НаКлиенте
// Процедура - обработчик события Выбор реквизита СписокЗапасы
//
Процедура СписокЗапасыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеТекущейСтроки = Элементы.СписокЗапасы.ТекущиеДанные;
	Если ДанныеТекущейСтроки.ИспользоватьХарактеристики Тогда
		
		ПерейтиКСпискуХарактеристикНоменклатуры(ДанныеТекущейСтроки.НоменклатураСсылка);
		
	Иначе
		
		ДобавитьНоменклатуруВКорзину();
		
	КонецЕсли;
	
КонецПроцедуры // СписокЗапасыВыбор()

&НаКлиенте
// Процедура - обработчик события ПриАктивизацииСтроки реквизита СписокЗапасы
//
Процедура СписокЗапасыПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("УправлениеДоступностьюНавигацииСписковНоменклатураХарактеристика", 0.2, Истина);
	
КонецПроцедуры // СписокЗапасыПриАктивизацииСтроки()

&НаКлиенте
// Процедура - обработчик события ОкончаниеПеретаскивания реквизита СписокЗапасы
//
Процедура СписокЗапасыОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДобавитьНоменклатуруВКорзину();
	
КонецПроцедуры // СписокЗапасыОкончаниеПеретаскивания()

&НаСервереБезКонтекста
Процедура СписокЗапасыПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	СоответствиеСтавокНДС = Настройки.ДополнительныеСвойства.СоответствиеСтавокНДС;
	Для Каждого КлючИЗначение Из Строки Цикл
		
		// Заполняем ставки НДС
		СтрокаСписка =  КлючИЗначение.Значение.Данные;
		СтрокаСписка.СтавкаНДС = СоответствиеСтавокНДС.Получить(СтрокаСписка.ВидСтавкиНДС);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокИерархияНоменклатурныхГрупп

&НаКлиенте
// Процедура - обработчик события ПриАктивизацииСтроки реквизита СписокИерархияНоменклатуры
//
Процедура СписокИерархияНоменклатурныхГруппПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("ОбновитьОтборПоГруппеДинамическихСписков", 0.2, Истина);
	
КонецПроцедуры // СписокИерархияНоменклатурныхГруппПриАктивизацииСтроки()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокИерархияНоменклатуры

&НаКлиенте
// Процедура - обработчик события ПриАктивизацииСтроки реквизита СписокИерархияНоменклатуры
//
Процедура СписокИерархияНоменклатурыПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("ОбновитьОтборПоГруппеДинамическихСписков", 0.2, Истина);
	
КонецПроцедуры // СписокИерархияНоменклатурыПриАктивизацииСтроки()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокХарактеристик

&НаКлиенте
// Процедура - обработчик события Выбор реквизита СписокХарактеристик
//
Процедура СписокХарактеристикВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДобавитьНоменклатуруВКорзину();
	
КонецПроцедуры // СписокХарактеристикВыбор()

&НаКлиенте
// Процедура - обработчик события ОкончаниеПеретаскивания реквизита СписокХарактеристик
//
Процедура СписокХарактеристикОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДобавитьНоменклатуруВКорзину();
	
КонецПроцедуры // СписокХарактеристикОкончаниеПеретаскивания()

&НаСервереБезКонтекста
Процедура СписокХарактеристикПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	СоответствиеСтавокНДС = Настройки.ДополнительныеСвойства.СоответствиеСтавокНДС;
	Для Каждого КлючИЗначение Из Строки Цикл
		
		// Заполняем ставки НДС
		СтрокаСписка =  КлючИЗначение.Значение.Данные;
		СтрокаСписка.СтавкаНДС = СоответствиеСтавокНДС.Получить(СтрокаСписка.ВидСтавкиНДС);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события ПриАктивизацииСтроки реквизита СписокХарактеристик
//
Процедура СписокХарактеристикПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("УправлениеДоступностьюНавигацииСписковНоменклатураХарактеристика", 0.2, Истина);
	
КонецПроцедуры // СписокХарактеристикПриАктивизацииСтроки()


#КонецОбласти

#Область КорзинаОстатокРезервХарактеристика

&НаКлиенте
// Процедура - обработчик события ПриИзменении реквизита Номенклатура табличного поля Корзина
//
Процедура КорзинаОстатокРезервХарактеристикаНоменклатураПриИзменении(Элемент)
	
	СтрокаКорзины = Элементы.КорзинаОстатокРезервХарактеристика.ТекущиеДанные;
	
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("Организация", 		Объект.Организация);
	СтруктураДанные.Вставить("Дата", 				Объект.Дата);
	СтруктураДанные.Вставить("Номенклатура", 		СтрокаКорзины.Номенклатура);
	СтруктураДанные.Вставить("Характеристика", 		СтрокаКорзины.Характеристика);
	
	СтруктураДанные = ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
	
	СтрокаКорзины.Количество 		= 1;
	СтрокаКорзины.ЕдиницаИзмерения	= СтруктураДанные.ЕдиницаИзмерения;
	
КонецПроцедуры // КорзинаНоменклатураПриИзменении()

&НаКлиенте
// Процедура - обработчик события ПриИзменении реквизита Характеристика табличного поля Корзина
//
Процедура КорзинаОстатокРезервХарактеристикаХарактеристикаПриИзменении(Элемент)
	
	СтрокаКорзины = Элементы.КорзинаОстатокРезервХарактеристика.ТекущиеДанные;
	
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("Организация", 		Объект.Организация);
	СтруктураДанные.Вставить("Дата", 				Объект.Дата);
	СтруктураДанные.Вставить("Номенклатура", 		СтрокаКорзины.Номенклатура);
	СтруктураДанные.Вставить("Характеристика", 		СтрокаКорзины.Характеристика);
	
	СтруктураДанные = ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
	
	СтрокаКорзины.Количество 		= 1;
	СтрокаКорзины.ЕдиницаИзмерения	= СтруктураДанные.ЕдиницаИзмерения;
	
КонецПроцедуры // КорзинаХарактеристикаПриИзменении()

&НаКлиенте
// Процедура - обработчик события ПриИзменении реквизита Количество табличного поля Корзина
//
Процедура КорзинаОстатокРезервХарактеристикаРезервПриИзменении(Элемент)
	
	СтрокаКорзины = Элементы.КорзинаОстатокРезервХарактеристика.ТекущиеДанные;
	
	Если СтрокаКорзины.Резерв > СтрокаКорзины.Количество Тогда
		
		СтрокаКорзины.Количество = СтрокаКорзины.Резерв;
		
	КонецЕсли;
	
КонецПроцедуры // КорзинаРезервПриИзменении()

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура - обработчик команды ВыполнитьПоиск
//
Процедура ВыполнитьПоиск(Команда)
	
	Если НЕ КешНастройкиПодбора.ПоискВыполненПриОкончанииРедактирования Тогда
		
		ВыполнитьПоискИУстановитьОтбор();
		
	Иначе
		
		КешНастройкиПодбора.ПоискВыполненПриОкончанииРедактирования = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры // ВыполнитьПоиск()

&НаКлиенте
// Процедура - обработчик команды ИзменитьНастройки
//
Процедура ИзменитьНастройки(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбновитьНастройкиПодбора", ЭтотОбъект);
	ОткрытьФорму("Обработка.ПодборПеремещение.Форма.Настройка", , ЭтаФорма, Истина, , , ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры // ИзменитьНастройки()

&НаКлиенте
// Процедура - обработчик команды ПеренестиВДокумент
//
Процедура ПеренестиВДокумент(Команда)
	
	Закрыть(ЗаписатьПодборВХранилище());
	
КонецПроцедуры // ПеренестиВДокумент()

// Процедура - обработчик команды Выбрать
//
&НаКлиенте
Процедура ДобавитьВКорзину(Команда)
	
	ДобавитьНоменклатуруВКорзину();
	
КонецПроцедуры // Выбрать()

&НаКлиенте
// Процедура - обработчик команды ПерейтиКРодителю (контекст. меню списка номенклатуры)
//
Процедура ПерейтиКРодителю(Команда)
	
	ДанныеТекущейСтроки = ПолучитьДанныеТекущейСтрокиСписка();
	
	Если ДанныеТекущейСтроки <> Неопределено Тогда
		
		Элементы.СписокИерархияНоменклатуры.ТекущаяСтрока = ДанныеТекущейСтроки.Родитель;
		
	КонецЕсли;
	
КонецПроцедуры // ПерейтиКРодителю()

&НаКлиенте
// Процедура - обработчик команды ПоказатьНоменклатуру (контекст. меню списка характеристик)
//
Процедура ПоказатьНоменклатуру(Команда)
	
	ПерейтиКСпискуНоменклатуры();
	
КонецПроцедуры // ПоказатьНоменклатуру()

&НаКлиенте
// Процедура - обработчик команды ИзменитьВидимостьСкладскихОстатков (меню формы)
//
Процедура ИзменитьВидимостьСкладскихОстатков(Команда)
	
	Элементы.ФормаИзменитьВидимостьСкладскихОстатков.Пометка = НЕ Элементы.ФормаИзменитьВидимостьСкладскихОстатков.Пометка;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокСкладскиеОстатки", "Видимость", Элементы.ФормаИзменитьВидимостьСкладскихОстатков.Пометка);
	
КонецПроцедуры // ИзменитьВидимостьСкладскихОстатков()

&НаКлиенте
// Процедура - обработчик команды ИзменитьВидимостьКорзины (меню формы)
//
Процедура ИзменитьВидимостьКорзины(Команда)
	
	Элементы.ФормаИзменитьВидимостьКорзины.Пометка = НЕ Элементы.ФормаИзменитьВидимостьКорзины.Пометка;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КорзинаОстатокРезервХарактеристика", "Видимость", Элементы.ФормаИзменитьВидимостьКорзины.Пометка);
	
КонецПроцедуры // ИзменитьВидимостьКорзины()

&НаКлиенте
// Процедура - обработчик команды ПереходПолнотекстовыйПоиск
Процедура ПереходПолнотекстовыйПоиск(Команда)
	
	УстановитьТекущийЭлементыФормы(Элементы.ТекстПоиска);
	
КонецПроцедуры // ПереходПолнотекстовыйПоиск()

&НаКлиенте
// Процедура - обработчик команды ПереходИерархия
Процедура ПереходИерархия(Команда)
	
	ИмяЭлемента = ?(ОтборИерархия = ПредопределенноеЗначение("Перечисление.ВидыОтборовНоменклатуры.ГруппыНоменклатуры"), "СписокИерархияНоменклатуры", "СписокИерархияНоменклатурныхГрупп");
	УстановитьТекущийЭлементыФормы(Элементы[ИмяЭлемента]);
	
КонецПроцедуры // ПереходИерархия()

&НаКлиенте
// Процедура - обработчик команды ПереходНоменклатураХарактеристики
//
Процедура ПереходНоменклатураХарактеристики(Команда)
	
	ЭтоНоменклатура = (Элементы.СтраницыНоменклатураХарактеристики.ТекущаяСтраница = Элементы.СтраницаНоменклатура);
	
	УстановитьТекущийЭлементыФормы(?(ЭтоНоменклатура, Элементы.СписокЗапасы, Элементы.СписокХарактеристик));
	
КонецПроцедуры // ПереходНоменклатураХарактеристики()

&НаКлиенте
// Процедура - обработчик команды ПереходКорзина
Процедура ПереходКорзина(Команда)
	
	УстановитьТекущийЭлементыФормы(Элементы.КорзинаОстатокРезервХарактеристика);
	
КонецПроцедуры // ПереходКорзина()

&НаКлиенте
// Процедура - обработчик команды ОбновлятьЗаголовки
//
Процедура ОбновлятьЗаголовки(Команда)
	
	Элементы.ФормаОбновлятьЗаголовки.Пометка = НЕ Элементы.ФормаОбновлятьЗаголовки.Пометка;
	
	// Если выключили обновление заголовок, вернем заголовки к типовому состоянию...
	Если НЕ Элементы.ФормаОбновлятьЗаголовки.Пометка Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокХарактеристикХарактеристикаСсылка", "Заголовок", НСтр("ru = 'Характеристика'"));
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокСкладскиеОстаткиСтруктурнаяЕдиница", "Заголовок", НСтр("ru = 'Склад'"));
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаПереходНоменклатураХарактеристики", "Заголовок", НСтр("ru = 'Номенклатура/Характеристики'"));
		
	КонецЕсли;
	
КонецПроцедуры // ОбновлятьЗаголовки()

&НаКлиенте
// Процедура - обработчик команды АвтоСбросТекстаПоиска
//
Процедура АвтоСбросОтбораСписков(Команда)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаАвтоСбросОтбораСписков", "Пометка", НЕ Элементы.ФормаАвтоСбросОтбораСписков.Пометка);
	
КонецПроцедуры // АвтоСбросТекстаПоиска()

&НаКлиенте
// Процедура - обработчик команды РасшифроватьРезерв
//
Процедура РасшифроватьРезерв(Команда)
	
	ДанныеТекущейСтроки = ПолучитьДанныеТекущейСтрокиСписка();
	Если ДанныеТекущейСтроки = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ПараметрыРасшифровки = Новый Структура;
	ПараметрыРасшифровки.Вставить("Организация", 	Объект.Организация);
	ПараметрыРасшифровки.Вставить("Номенклатура",	ДанныеТекущейСтроки.НоменклатураСсылка);
	ПараметрыРасшифровки.Вставить("Характеристика", ДанныеТекущейСтроки.ХарактеристикаСсылка);
	
	Если Элементы.СписокЗапасы.ТекущийЭлемент  = Элементы.СписокЗапасыСвободноПолучатель Тогда
		
		ПараметрыРасшифровки.Вставить("СтруктурнаяЕдиница", Объект.СтруктурнаяЕдиницаПолучатель);
		
	Иначе
		
		ПараметрыРасшифровки.Вставить("СтруктурнаяЕдиница", Объект.СтруктурнаяЕдиницаОтправитель);
		
	КонецЕсли;
	
	ОписаниеОповещенияПриЗакрытииПодбора = Новый ОписаниеОповещения("ПослеОткрытияРасшифровкиРезерва", ЭтотОбъект, ПараметрыРасшифровки);
	ОткрытьФорму("Обработка.ПодборПеремещение.Форма.РасшифроватьРезерв", ПараметрыРасшифровки, ЭтаФорма, Истина, , ,ОписаниеОповещенияПриЗакрытииПодбора , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры // РасшифроватьРезерв()

&НаКлиенте
// Процедура - обработчик команды АналогиНоменклатуры
//
Процедура АналогиНоменклатуры(Команда)
	Перем ТекстСообщения;
	
	Если Элементы.СписокЗапасыКонтекстноеМенюАналогиНоменклатуры.Пометка Тогда
		
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(СписокЗапасы, "НоменклатураСсылка");
		Элементы.СписокЗапасыКонтекстноеМенюАналогиНоменклатуры.Пометка = Ложь;
		
		Если Элементы.ФормаОбновлятьЗаголовки.Пометка Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокЗапасыНаименование", "Заголовок", НСтр("ru = 'Номенклатура'"));
			
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;
	
	ДанныеТекущейСтроки = Элементы.СписокЗапасы.ТекущиеДанные;
	Если ДанныеТекущейСтроки <> Неопределено Тогда
		
		ОтборПоАналогамНоменклатуры(ДанныеТекущейСтроки.НоменклатураСсылка, ТекстСообщения);
		
		Если ПустаяСтрока(ТекстСообщения) Тогда
			
			Элементы.СписокЗапасыКонтекстноеМенюАналогиНоменклатуры.Пометка = Истина;
			
			Если Элементы.ФормаОбновлятьЗаголовки.Пометка Тогда
				
				ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокЗапасыНаименование", "Заголовок", НСтр("ru = 'Номенклатура (вкл. Аналоги)'"));
				
			КонецЕсли
			
		Иначе
			
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "СписокЗапасыНаименование", , );
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // АналогиНоменклатуры()

&НаКлиенте
// Процедура - обработчик команды СведенияОДокументе
//
Процедура СведенияОДокументе(Команда)
	
	ОписаниеОповещенияПриЗакрытииПодбора = Новый ОписаниеОповещения("ПослеЗакрытияФормыСведенияОДокументе", ЭтотОбъект);
	ОткрытьФорму("Обработка.ПодборПеремещение.Форма.СведенияОДокументе", КешНастройкиПодбора.СведенияОДокументе, ЭтаФорма, Истина, , ,ОписаниеОповещенияПриЗакрытииПодбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры // СведенияОДокументе()

&НаКлиенте
// Процедура - обработчик команды НоменклатураИмеетсяВНаличии
//
Процедура НоменклатураИмеетсяВНаличии(Команда)
	
	НоменклатураИмеетсяВНаличии = НЕ НоменклатураИмеетсяВНаличии;
	
	ВключитьВыключитьОтборНоменклатурыВНаличии();
	
КонецПроцедуры // НоменклатураИмеетсяВНаличии()

&НаКлиенте
// Процедура - обработчик команды ЗаполнятьКоличествоРезерва
//
Процедура ЗаполнятьКоличествоРезерва(Команда)
	
	ЗаполнятьКоличествоРезерва = НЕ ЗаполнятьКоличествоРезерва;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаЗаполнятьКоличествоРезерва", "Пометка", ЗаполнятьКоличествоРезерва);
	
КонецПроцедуры // ЗаполнятьКоличествоРезерва()

&НаКлиенте
// Процедура - обработчик команды ПолнотекстовыйПоискЛюбыеОкончания
//
Процедура ПолнотекстовыйПоискЛюбыеОкончания(Команда)
	
	ИмяНастройки = "ФормаПолнотекстовыйПоискЛюбыеОкончания";
	УправлениеНастройкамиПолнотекстовогоПоискаНаКлиенте(ИмяНастройки);
	
КонецПроцедуры // ПолнотекстовыйПоискЛюбыеОкончания()

&НаКлиенте
// Процедура - обработчик команды ПолнотекстовыйПоискОпечатки
//
Процедура ПолнотекстовыйПоискОпечатки(Команда)
	
	ИмяНастройки = "ФормаПолнотекстовыйПоискОпечатки";
	УправлениеНастройкамиПолнотекстовогоПоискаНаКлиенте(ИмяНастройки);
	
КонецПроцедуры // ПолнотекстовыйПоискОпечатки()

&НаКлиенте
// Процедура - обработчик команды НавигацияСписковНоменклатураХарактеристики
//
Процедура НавигацияСписковНоменклатураХарактеристики(Команда)
	
	Если Элементы.СтраницыНоменклатураХарактеристики.ТекущаяСтраница = Элементы.СтраницаНоменклатура Тогда
		
		ДанныеТекущейСтроки = Элементы.СписокЗапасы.ТекущиеДанные;
		Если ДанныеТекущейСтроки.ИспользоватьХарактеристики Тогда
			
			ПерейтиКСпискуХарактеристикНоменклатуры(ДанныеТекущейСтроки.НоменклатураСсылка);
			
		КонецЕсли;
		
	Иначе
		
		ПерейтиКСпискуНоменклатуры();
		
	КонецЕсли;
	
КонецПроцедуры // НавигацияСписковНоменклатураХарактеристики()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПолнотекстовыйПоиск

&НаСервереБезКонтекста
// Функция заполняет массив ссылок результата поиска или возвращает описание ошибки
//
//
Функция ПолнотекстовыйПоискНаСервереБезКонтекста(СтрокаПоиска, РезультатПоиска)
	
	ОписаниеОшибки = "";
	РезультатПоиска = ПодборНоменклатурыВДокументахПереопределяемый.ПоискТоваров(СтрокаПоиска, ОписаниеОшибки);
	
	Возврат ОписаниеОшибки;
	
КонецФункции // ПолнотекстовыйПоискНаСервереБезКонтекста()

&НаКлиенте
// Функция добавляет в строку ПП поиска служебные символы в зависимости от включенных опций
//
Функция СформироватьУниверсальнуюСтрокуПоиска(ТекстПоиска)
	
	Возврат ?(Элементы.ФормаПолнотекстовыйПоискОпечатки.Пометка, "#", "") + ТекстПоиска + ?(Элементы.ФормаПолнотекстовыйПоискЛюбыеОкончания.Пометка, "*", "");
	
КонецФункции // СформироватьУниверсальнуюСтрокуПоиска()

&НаКлиенте
// Процедура устанавливает отбор по ссылкам полученными полнотекстовым поиском
//
Процедура ПолнотекстовыйПоискНаКлиенте()
	
	Если НЕ ПустаяСтрока(ТекстПоиска) Тогда
		
		РезультатПоиска = Неопределено;
		
		УниверсальнаяСтрокаПоиска = СформироватьУниверсальнуюСтрокуПоиска(ТекстПоиска);
		ОписаниеОшибки = ПолнотекстовыйПоискНаСервереБезКонтекста(УниверсальнаяСтрокаПоиска, РезультатПоиска);
		
		Если ПустаяСтрока(ОписаниеОшибки) Тогда
			
			Если Элементы.СтраницыНоменклатураХарактеристики.ТекущаяСтраница = Элементы.СтраницаНоменклатура Тогда
				
				Использование = РезультатПоиска.Номенклатура.Количество() > 0;
				МассивЭлементов = ОбщегоНазначенияКлиентСервер.НайтиЭлементыИГруппыОтбора(СписокЗапасы.КомпоновщикНастроек.ФиксированныеНастройки.Отбор, "НоменклатураСсылка");
				Если МассивЭлементов.Количество() = 0 Тогда
					
					ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(СписокЗапасы.КомпоновщикНастроек.ФиксированныеНастройки.Отбор, "НоменклатураСсылка", ВидСравненияКомпоновкиДанных.ВСписке, РезультатПоиска.Номенклатура, , Использование);
					
				Иначе
					
					ОбщегоНазначенияКлиентСервер.ИзменитьЭлементыОтбора(СписокЗапасы.КомпоновщикНастроек.ФиксированныеНастройки.Отбор, "НоменклатураСсылка", , РезультатПоиска.Номенклатура, ВидСравненияКомпоновкиДанных.ВСписке, Использование);
					
				КонецЕсли;
				
				ЭтаФорма.ТекущийЭлемент = Элементы.СписокЗапасы;
				
			Иначе
				
				Использование = РезультатПоиска.ХарактеристикиНоменклатуры.Количество() > 0;
				МассивЭлементовХарактеристик = ОбщегоНазначенияКлиентСервер.НайтиЭлементыИГруппыОтбора(СписокХарактеристик.КомпоновщикНастроек.ФиксированныеНастройки.Отбор, "ХарактеристикаСсылка");
				Если МассивЭлементовХарактеристик.Количество() = 0 Тогда
					
					ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(СписокХарактеристик.КомпоновщикНастроек.ФиксированныеНастройки.Отбор, "ХарактеристикаСсылка", ВидСравненияКомпоновкиДанных.ВСписке, РезультатПоиска.ХарактеристикиНоменклатуры, , Использование);
					
				Иначе
					
					ОбщегоНазначенияКлиентСервер.ИзменитьЭлементыОтбора(СписокХарактеристик.КомпоновщикНастроек.ФиксированныеНастройки.Отбор, "ХарактеристикаСсылка", , РезультатПоиска.ХарактеристикиНоменклатуры, ВидСравненияКомпоновкиДанных.ВСписке, Использование);
					
				КонецЕсли;
				
				ЭтаФорма.ТекущийЭлемент = Элементы.СписокХарактеристик;
				
			КонецЕсли;
			
		Иначе
			
			ПоказатьПредупреждение(Неопределено, ОписаниеОшибки, 5, "Поиск...");
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ПолнотекстовыйПоискНаКлиенте()

&НаКлиенте
// Процедура устанавливает отбор по ссылкам полученными контекстным поиском
//
Процедура КонтекстныйПоискНаКлиенте()
	
	ПредставлениеГруппыПолей = "Контекстный поиск";
	
	Если ПустаяСтрока(ТекстПоиска) Тогда
		
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(СписокЗапасы, "НоменклатураСсылка", ПредставлениеГруппыПолей);
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(СписокХарактеристик, "ХарактеристикаСсылка", ПредставлениеГруппыПолей);
		
	Иначе
		
		СтруктураМассивов = ПодборНоменклатурыВДокументахВызовСервера.МассивыОтборовНоменклатурыИХарактеристик(ТекстПоиска);
		
		Если Элементы.СтраницыНоменклатураХарактеристики.ТекущаяСтраница = Элементы.СтраницаНоменклатура Тогда
			
			ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(СписокХарактеристик, "ХарактеристикаСсылка", ПредставлениеГруппыПолей);
			
			МассивЭлементов = ОбщегоНазначенияКлиентСервер.НайтиЭлементыИГруппыОтбора(СписокЗапасы.КомпоновщикНастроек.ФиксированныеНастройки.Отбор, , ПредставлениеГруппыПолей);
			Если МассивЭлементов.Количество() = 0 Тогда
				
				ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(СписокЗапасы.КомпоновщикНастроек.ФиксированныеНастройки.Отбор, "НоменклатураСсылка", ВидСравненияКомпоновкиДанных.ВСписке, СтруктураМассивов.ОтборНоменклатура, ПредставлениеГруппыПолей, Истина);
				
			Иначе
				
				ОбщегоНазначенияКлиентСервер.ИзменитьЭлементыОтбора(СписокЗапасы.КомпоновщикНастроек.ФиксированныеНастройки.Отбор, "НоменклатураСсылка", ПредставлениеГруппыПолей, СтруктураМассивов.ОтборНоменклатура, ВидСравненияКомпоновкиДанных.ВСписке, Истина);
				
			КонецЕсли;
			
			ЭтаФорма.ТекущийЭлемент = Элементы.СписокЗапасы;
			
		Иначе
			
			ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(СписокЗапасы, "НоменклатураСсылка", ПредставлениеГруппыПолей);
			
			МассивЭлементовХарактеристик = ОбщегоНазначенияКлиентСервер.НайтиЭлементыИГруппыОтбора(СписокХарактеристик.КомпоновщикНастроек.ФиксированныеНастройки.Отбор, "ХарактеристикаСсылка");
			Если МассивЭлементовХарактеристик.Количество() = 0 Тогда
				
				ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(СписокХарактеристик.КомпоновщикНастроек.ФиксированныеНастройки.Отбор, "ХарактеристикаСсылка", ВидСравненияКомпоновкиДанных.ВСписке, СтруктураМассивов.ОтборХарактеристики, ПредставлениеГруппыПолей, Истина);
				
			Иначе
				
				ОбщегоНазначенияКлиентСервер.ИзменитьЭлементыОтбора(СписокХарактеристик.КомпоновщикНастроек.ФиксированныеНастройки.Отбор, "ХарактеристикаСсылка", ПредставлениеГруппыПолей, СтруктураМассивов.ОтборХарактеристики, ВидСравненияКомпоновкиДанных.ВСписке, Истина);
				
			КонецЕсли;
			
			ЭтаФорма.ТекущийЭлемент = Элементы.СписокХарактеристик;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // КонтекстныйПоискНаКлиенте()

&НаКлиенте
// Процедура инициализирует выполнение полнотекстового поиска и установку отбора
// 
Процедура ВыполнитьПоискИУстановитьОтбор()
	
	Если ИспользоватьПолнотекстовыйПоиск Тогда
		
		ПолнотекстовыйПоискНаКлиенте();
		
	Иначе
		
		КонтекстныйПоискНаКлиенте();
		
	КонецЕсли;
	
КонецПроцедуры // ВыполнитьПоискИУстановитьОтбор()

&НаКлиенте
// Процедура сбрасывает отбор динамических списков
//
Процедура СброситьОтборПоДинамическомуСписку()
	
	ТекстПоиска = "";
	Если ИспользоватьПолнотекстовыйПоиск Тогда
		
		УправлениеНебольшойФирмойКлиент.УдалитьЭлементОтбораСписка(СписокЗапасы, "НоменклатураСсылка");
		УправлениеНебольшойФирмойКлиент.УдалитьЭлементОтбораСписка(СписокХарактеристик, "ХарактеристикаСсылка");
		
	Иначе
		
		КонтекстныйПоискНаКлиенте();
		
	КонецЕсли;
	
КонецПроцедуры //СброситьОтборПоДинамическомуСписку()

&НаКлиенте
// Процедура управляет переключением опций ПП и их зависимостью
//
Процедура УправлениеНастройкамиПолнотекстовогоПоискаНаКлиенте(ИмяНастройки)
	
	Элементы[ИмяНастройки].Пометка = НЕ Элементы[ИмяНастройки].Пометка;
	
	Если Элементы[ИмяНастройки].Пометка Тогда
		
		ВзаимноИсключаемыеНастройкиПП = КешНастройкиПодбора.ВзаимноИсключаемыеНастройкиПП;
		Элементы[ВзаимноИсключаемыеНастройкиПП[ИмяНастройки]].Пометка = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры // ПереключитьВариантПолнотекстовогоПоискаНаКлиенте()

&НаСервере
// Процедура устанавливает подсказку ввода для элемента формы ПоискТекста
//
Процедура УстановитьПодсказкуВводаСтрокиПоискаНаСервере()
	
	ПолнотекстовыйПоискНастроенЧастично = (ИспользоватьПолнотекстовыйПоиск И НЕ АктуальностьИндексаППД);
	ПодсказкаВвода = ?(ПолнотекстовыйПоискНастроенЧастично, НСтр("ru = 'Необходимо обновить индекс полнотекстового поиска...'"), НСтр("ru = '(ALT+F3) Введите текст поиска...'"));
	Элементы.ТекстПоиска.ПодсказкаВвода = ПодсказкаВвода;
	
КонецПроцедуры // УстановитьПодсказкуВводаСтрокиПоискаНаСервере()

&НаСервере
// Процедура подключает полнотекстовый поиск и устанавливает свойства реквизитов формы
//
Процедура ПодключитьПолнотекстовыйПоискПриОткрытииПодбора()
	
	ИспользоватьПолнотекстовыйПоиск = ПолучитьФункциональнуюОпцию("ИспользоватьПолнотекстовыйПоиск") И НЕ РаботаВМоделиСервиса.РазделениеВключено();
	Если ИспользоватьПолнотекстовыйПоиск Тогда
		
		АктуальностьИндексаППД = ПолнотекстовыйПоиск.ИндексАктуален();
		
		Если НЕ АктуальностьИндексаППД Тогда
			
			Если ОбщегоНазначения.РазделениеВключено()
				И ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных() Тогда
				
				// в разделенной ИБ считаем актуальным индекс в пределах 2 дней
				АктуальностьИндексаППД = ПолнотекстовыйПоиск.ДатаАктуальности() >= (ТекущаяДатаСеанса()-(2*24*60*60));
				
			Иначе
				
				// в неразделенной ИБ считаем актуальным индекс в пределах дня
				АктуальностьИндексаППД = ПолнотекстовыйПоиск.ДатаАктуальности() >= (ТекущаяДатаСеанса() - (1*24*60*60));
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьПодсказкуВводаСтрокиПоискаНаСервере();
	
КонецПроцедуры // ПодключитьПолнотекстовыйПоискПриОткрытииПодбора()

#КонецОбласти

#Область ДобавлениеТовараВКорзину

&НаКлиенте
// Функция возвращает текущие данные строки элемента формы табличное поле
//
Функция ПолучитьДанныеТекущейСтрокиСписка()
	
	ДанныеТекущейСтроки = ?(Элементы.СтраницыНоменклатураХарактеристики.ТекущаяСтраница = Элементы.СтраницаНоменклатура,
			Элементы.СписокЗапасы.ТекущиеДанные,
			Элементы.СписокХарактеристик.ТекущиеДанные);
	
	Возврат ДанныеТекущейСтроки;
	
КонецФункции // ПолучитьДанныеТекущейСтрокиСписка()

&НаКлиенте
// Функция ищет строки в корзине подбора с казанной номенклатурой
// 	используется перед добавление номенклатуры в корзину.
//
// Возвращает:
//		- Неопределено, если номенклатура не найдена;
//		- Строку корзины, если номенклатура найдена;
//
Функция НайтиНоменклатуруВКорзине(ДанныеТекущейСтроки)
	
	СтруктураОтбора = Новый Структура("Номенклатура, Характеристика", ДанныеТекущейСтроки.НоменклатураСсылка, ДанныеТекущейСтроки.ХарактеристикаСсылка);
	НайденныеСтроки = Объект.КорзинаОстатокРезервХарактеристика.НайтиСтроки(СтруктураОтбора);
	
	Возврат ?(НайденныеСтроки.Количество() = 0, Неопределено, НайденныеСтроки[0]);
	
КонецФункции // НайтиНоменклатуруВКорзине()

&НаКлиенте
// Процедура добавления номенклатуры в корзину подбора
//
Процедура ДобавитьНоменклатуруВКорзину()
	
	ДанныеТекущейСтроки = ПолучитьДанныеТекущейСтрокиСписка();
	Если ДанныеТекущейСтроки = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ДанныеСтрокиКорзины = Новый Структура;
	
	НайденнаяСтрока = НайтиНоменклатуруВКорзине(ДанныеТекущейСтроки);
	ДанныеСтрокиКорзины.Вставить("СтрокаКорзины", ?(НайденнаяСтрока <> Неопределено, НайденнаяСтрока.ПолучитьИдентификатор(), НайденнаяСтрока));
	ДанныеСтрокиКорзины.Вставить("Номенклатура", ДанныеТекущейСтроки.НоменклатураСсылка);
	ДанныеСтрокиКорзины.Вставить("Характеристика", ДанныеТекущейСтроки.ХарактеристикаСсылка);
	ДанныеСтрокиКорзины.Вставить("ЭтоНабор", ДанныеТекущейСтроки.ЭтоНабор);
	ДанныеСтрокиКорзины.Вставить("ЕдиницаИзмерения", ДанныеТекущейСтроки.ЕдиницаИзмерения);
	ДанныеСтрокиКорзины.Вставить("Свободно", ДанныеТекущейСтроки.СвободноОтправитель);
	ДанныеСтрокиКорзины.Вставить("СтранаПроисхождения", ДанныеТекущейСтроки.СтранаПроисхождения);
	
	Если КешНастройкиПодбора.ЗапрашиватьКоличество Тогда
		
		ДанныеСтрокиКорзины.Вставить("КешНастройкиПодбора",	КешНастройкиПодбора);
		ДанныеСтрокиКорзины.Вставить("Количество",			1);
		ДанныеСтрокиКорзины.Вставить("ЕдиницаИзмерения", 	ДанныеСтрокиКорзины.ЕдиницаИзмерения);
		
		ОписаниеОповещенияПриЗакрытииПодбора = Новый ОписаниеОповещения("ПослеВыбораКоличества", ЭтотОбъект, ДанныеСтрокиКорзины);
		ОткрытьФорму("Обработка.ПодборПеремещение.Форма.Количество", ДанныеСтрокиКорзины, ЭтаФорма, Истина, , ,ОписаниеОповещенияПриЗакрытииПодбора , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	Иначе
		
		Если ДанныеСтрокиКорзины.СтрокаКорзины = Неопределено Тогда
			
			СтрокаКорзины = Объект.КорзинаОстатокРезервХарактеристика.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаКорзины, ДанныеСтрокиКорзины);
			
		Иначе
			
			СтрокаКорзины = НайденнаяСтрока;
			
		КонецЕсли;
		
		СтрокаКорзины.Количество = СтрокаКорзины.Количество + 1;
		СтрокаКорзины.Резерв	 = ?(ВключеноРезервирование И ЗаполнятьКоличествоРезерва, МИН(СтрокаКорзины.Количество, ДанныеСтрокиКорзины.Свободно),0);
		
	КонецЕсли;
	
КонецПроцедуры // ДобавитьНоменклатуруВКорзину()

#КонецОбласти

#Область УправлениеСписками

&НаКлиенте
// Процедура устанавливает отбор в списке запасов по массиву аналогов номенклатуры
//
Процедура ОтборПоАналогамНоменклатуры(Номенклатура, ТекстСообщения)
	
	СписокАналоговНоменклатуры = Новый СписокЗначений;
	ПолучитьАналогиНоменклатуры(Номенклатура, СписокАналоговНоменклатуры);
	
	Если СписокАналоговНоменклатуры.Количество() = 0 Тогда
		
		ТекстСообщения = НСтр("ru = 'Для номенклатуры не заведены аналоги.'");
		
	Иначе
		
		МассивЭлементов = ОбщегоНазначенияКлиентСервер.НайтиЭлементыИГруппыОтбора(СписокЗапасы.КомпоновщикНастроек.ФиксированныеНастройки.Отбор, "НоменклатураСсылка");
		Если МассивЭлементов.Количество() = 0 Тогда
			
			ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(СписокЗапасы.КомпоновщикНастроек.ФиксированныеНастройки.Отбор, "НоменклатураСсылка", ВидСравненияКомпоновкиДанных.ВСписке, СписокАналоговНоменклатуры);
			
		Иначе
			
			ОбщегоНазначенияКлиентСервер.ИзменитьЭлементыОтбора(СписокЗапасы.КомпоновщикНастроек.ФиксированныеНастройки.Отбор, "НоменклатураСсылка", , СписокАналоговНоменклатуры, ВидСравненияКомпоновкиДанных.ВСписке);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ОтборПоАналогамНоменклатуры()

&НаКлиенте
// Процедура обновляет динамические списки Запасы
//
Процедура ОбновитьОтборПоГруппеДинамическихСписков()
	
	Если ОтборИерархия = ПредопределенноеЗначение("Перечисление.ВидыОтборовНоменклатуры.ГруппыНоменклатуры") Тогда
		
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(СписокЗапасы, "КатегорияНоменклатуры");
		ИмяДинамическогоСписка = "СписокИерархияНоменклатуры";
		ИмяОтбора = "Родитель";
		
	ИначеЕсли ОтборИерархия = ПредопределенноеЗначение("Перечисление.ВидыОтборовНоменклатуры.КатегорииНоменклатуры") Тогда
		
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(СписокЗапасы, "Родитель");
		ИмяДинамическогоСписка = "СписокИерархияНоменклатурныхГрупп";
		ИмяОтбора = "КатегорияНоменклатуры";
		
	КонецЕсли;
	
	ДанныеТекущейСтроки = Элементы[ИмяДинамическогоСписка].ТекущиеДанные;
	Если ДанныеТекущейСтроки = Неопределено Тогда
		
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(СписокЗапасы, ИмяОтбора);
		
		ИзменитьЗаголовокГруппыОтборов(Ложь);
		
	Иначе
		
		МассивЭлементов = ОбщегоНазначенияКлиентСервер.НайтиЭлементыИГруппыОтбора(СписокЗапасы.КомпоновщикНастроек.ФиксированныеНастройки.Отбор, ИмяОтбора);
		Если МассивЭлементов.Количество() = 0 Тогда
			
			ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(СписокЗапасы.КомпоновщикНастроек.ФиксированныеНастройки.Отбор, ИмяОтбора, ВидСравненияКомпоновкиДанных.ВИерархии, ДанныеТекущейСтроки.Ссылка);
			
		Иначе
			
			ОбщегоНазначенияКлиентСервер.ИзменитьЭлементыОтбора(СписокЗапасы.КомпоновщикНастроек.ФиксированныеНастройки.Отбор, ИмяОтбора, , ДанныеТекущейСтроки.Ссылка, ВидСравненияКомпоновкиДанных.ВИерархии);
			
		КонецЕсли;
		
		ИзменитьЗаголовокГруппыОтборов(Истина);
		
	КонецЕсли;
	
КонецПроцедуры //ОбновитьОтборПоГруппеДинамическихСписков()

&НаКлиенте
// Открыть список характеристик и установить отбор по номенклатуре
//
Процедура ПоказатьСписокХарактеристик()
	
	ТекущиеДанныеСпискаНоменклатуры = Элементы.СписокЗапасы.ТекущиеДанные;
	
	МассивЭлементов = ОбщегоНазначенияКлиентСервер.НайтиЭлементыИГруппыОтбора(СписокХарактеристик.КомпоновщикНастроек.ФиксированныеНастройки.Отбор, "НоменклатураСсылка");
	Если МассивЭлементов.Количество() = 0 Тогда
		
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(СписокХарактеристик.КомпоновщикНастроек.ФиксированныеНастройки.Отбор, "НоменклатураСсылка", ВидСравненияКомпоновкиДанных.Равно, ТекущиеДанныеСпискаНоменклатуры.НоменклатураСсылка);
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.ИзменитьЭлементыОтбора(СписокХарактеристик.КомпоновщикНастроек.ФиксированныеНастройки.Отбор, "НоменклатураСсылка", , ТекущиеДанныеСпискаНоменклатуры.НоменклатураСсылка, ВидСравненияКомпоновкиДанных.Равно);
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокИерархияНоменклатуры", "Доступность", Ложь);
	Элементы.СписокИерархияНоменклатуры.ЦветТекста = Новый Цвет(150, 150, 150);
	Элементы.СтраницыНоменклатураХарактеристики.ТекущаяСтраница = Элементы.СтраницаХарактеристики;
	
КонецПроцедуры // ПоказатьСписокХарактеристик()

&НаСервере
// Процедура устанавливает значения параметров динамических списков 
//
// Значения считываются из реквизитов обработки
//
Процедура УстановитьПараметрыДинамическихСписков()
	
	// Параметры, заполняемые особым образом, например, Организация
	ПараметрОрганизация = Новый ПараметрКомпоновкиДанных("Организация");
	
	МассивСписков = Новый Массив;
	МассивСписков.Добавить(СписокИерархияНоменклатуры);
	МассивСписков.Добавить(СписокЗапасы);
	МассивСписков.Добавить(СписокХарактеристик);
	МассивСписков.Добавить(СписокСкладскиеОстатки);
	
	Для каждого ДинамическийСписок Из МассивСписков Цикл
	
		Для Каждого ПараметрСписка Из ДинамическийСписок.Параметры.Элементы Цикл
		ДинамическийСписок.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("СоответствиеСтавокНДС",
			УправлениеНебольшойФирмойПовтИсп.СоответствиеСтавокНДС(?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДатаСеанса())));
			
			ЗначениеРеквизитаОбъекта = Неопределено;
			Если ПараметрСписка.Параметр = ПараметрОрганизация Тогда
				
				ДинамическийСписок.Параметры.УстановитьЗначениеПараметра(ПараметрСписка.Параметр, Константы.УчетПоКомпании.Компания(Объект.Организация));
				
			ИначеЕсли Объект.Свойство(ПараметрСписка.Параметр, ЗначениеРеквизитаОбъекта) Тогда
				
				Если ПодборНоменклатурыВДокументах.ЭтоСписокЗначений(ЗначениеРеквизитаОбъекта) Тогда
					
					ЗначениеРеквизитаОбъекта = ПодборНоменклатурыВДокументах.СписокЗначенийВМассив(ЗначениеРеквизитаОбъекта);
					
				КонецЕсли;
				
				ДинамическийСписок.Параметры.УстановитьЗначениеПараметра(ПараметрСписка.Параметр, ЗначениеРеквизитаОбъекта);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры // УстановитьПараметрыДинамическихСписков()

&НаКлиенте
// Процедура устанавливает значения параметров динамических списков 
//
Процедура УстановитьЗаголовкиСписков()
	
	Если Элементы.ФормаОбновлятьЗаголовки.Пометка Тогда
	
		Если Элементы.СтраницыНоменклатураХарактеристики.ТекущаяСтраница = Элементы.СтраницаХарактеристики Тогда
			
			ДанныеТекущейСтроки = ПолучитьДанныеТекущейСтрокиСписка();
			ДанныеТекущейСтрокиЗаполнены = (ДанныеТекущейСтроки <> Неопределено);
			
			ПредставлениеНоменклатуры = ?(ДанныеТекущейСтрокиЗаполнены, Строка(ДанныеТекущейСтроки.НоменклатураСсылка),
				"<...>");
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
				"СписокХарактеристикХарактеристикаСсылка", "Заголовок", СтрШаблон(НСтр("ru = 'Характеристики: %1'"),
				ПредставлениеНоменклатуры));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
				"СписокСкладскиеОстаткиСтруктурнаяЕдиница", "Заголовок", СтрШаблон(НСтр("ru = 'Склад. остатки: %1'"),
				ПредставлениеНоменклатуры));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
				"ФормаПереходНоменклатураХарактеристики", "Заголовок", НСтр("ru = 'Характеристики'"));
			
		Иначе
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
				"СписокХарактеристикХарактеристикаСсылка", "Заголовок", НСтр("ru = 'Характеристика'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
				"СписокСкладскиеОстаткиСтруктурнаяЕдиница", "Заголовок", НСтр("ru = 'Склад'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
				"ФормаПереходНоменклатураХарактеристики", "Заголовок", НСтр("ru = 'Номенклатура'"));
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // УстановитьЗаголовкиСписков()

&НаКлиенте
// Процедура отвечает за переход к списку характеристик номенклатуры
//
Процедура ПерейтиКСпискуХарактеристикНоменклатуры(НоменклатураСсылка)
	
	Если Элементы.ФормаОбновлятьЗаголовки.Пометка Тогда
		
		ВладелецХарактеристики = НоменклатураСсылка;
		
	КонецЕсли;
	
	ПоказатьСписокХарактеристик();
	ПодключитьОбработчикОжидания("УстановитьЗаголовкиСписков", 0.1, Истина);
	ВыводитьСоветВернутьсяКНоменклатуре();
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НавигацияСписковНоменклатураХарактеристики", "Заголовок", НСтр("ru ='Номенклатура'"));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НавигацияСписковНоменклатураХарактеристики", "Картинка", БиблиотекаКартинок.Назад);
	
	Если НЕ ПустаяСтрока(ТекстПоиска) Тогда
		
		ТекстПоиска = "";
		
		Если Элементы.ФормаАвтоСбросОтбораСписков.Пометка Тогда
			
			ПодключитьОбработчикОжидания("СброситьОтборПоДинамическомуСписку", 0.1, Истина);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ПерейтиКСпискуХарактеристикНоменклатуры()

&НаКлиенте
// Процедура отвечает за возврат к списку номенклатуры из списка характеристик
//
Процедура ПерейтиКСпискуНоменклатуры()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокИерархияНоменклатуры", "Доступность", Истина);
	
	Если ЗначениеЗаполнено(ВладелецХарактеристики) Тогда
		
		Элементы.СписокЗапасы.ТекущаяСтрока = ВладелецХарактеристики;
		ВладелецХарактеристики = Неопределено;
		
	КонецЕсли;
	
	Элементы.СписокИерархияНоменклатуры.ЦветТекста = Новый Цвет();
	
	Элементы.СтраницыНоменклатураХарактеристики.ТекущаяСтраница = Элементы.СтраницаНоменклатура;
	
	ПодключитьОбработчикОжидания("УстановитьЗаголовкиСписков", 0.1, Истина);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НавигацияСписковНоменклатураХарактеристики", "Заголовок", НСтр("ru ='Характеристики'"));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НавигацияСписковНоменклатураХарактеристики", "Картинка", БиблиотекаКартинок.Вперед);
	
	Если НЕ ПустаяСтрока(ТекстПоиска) Тогда
		
		ТекстПоиска = "";
		
		Если Элементы.ФормаАвтоСбросОтбораСписков.Пометка Тогда
			
			ПодключитьОбработчикОжидания("СброситьОтборПоДинамическомуСписку", 0.1, Истина);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ПерейтиКСпискуНоменклатуры()

&НаКлиенте
// Процедура отвечает за доступность кнопки перейти к характеристикам/номенклатуре
//
Процедура УправлениеДоступностьюНавигацииСписковНоменклатураХарактеристика()
	
	ДанныеТекущейСтроки = Элементы.СписокЗапасы.ТекущиеДанные;
	Если ДанныеТекущейСтроки <> Неопределено Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НавигацияСписковНоменклатураХарактеристики", "Доступность", ДанныеТекущейСтроки.ИспользоватьХарактеристики);
		
	ИначеЕсли Элементы.НавигацияСписковНоменклатураХарактеристики.Доступность = Ложь
		И Элементы.СтраницыНоменклатураХарактеристики.ТекущаяСтраница <> Элементы.СтраницаНоменклатура Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НавигацияСписковНоменклатураХарактеристики", "Доступность", Истина);
		
	ИначеЕсли ДанныеТекущейСтроки = Неопределено
		И Элементы.СтраницыНоменклатураХарактеристики.ТекущаяСтраница = Элементы.СтраницаНоменклатура Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НавигацияСписковНоменклатураХарактеристики", "Доступность", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокЗапасыКонтекстноеМенюПоказатьСоставНабора", "Доступность", Ложь);
		
	КонецЕсли;
	
КонецПроцедуры // УправлениеДоступностьюНавигацииСписковНоменклатураХарактеристика()

&НаКлиенте
// Процедура отвечает за установку, снятие отбора по наличию остатков
//
Процедура ВключитьВыключитьОтборНоменклатурыВНаличии()
	
	Если НоменклатураИмеетсяВНаличии Тогда
		
		МассивЭлементов = ОбщегоНазначенияКлиентСервер.НайтиЭлементыИГруппыОтбора(СписокЗапасы.КомпоновщикНастроек.ФиксированныеНастройки.Отбор, "ОстатокОтправитель");
		Если МассивЭлементов.Количество() = 0 Тогда
			
			ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(СписокЗапасы.КомпоновщикНастроек.ФиксированныеНастройки.Отбор, "ОстатокОтправитель", ВидСравненияКомпоновкиДанных.Заполнено, 0);
			
		Иначе
			
			ОбщегоНазначенияКлиентСервер.ИзменитьЭлементыОтбора(СписокЗапасы.КомпоновщикНастроек.ФиксированныеНастройки.Отбор, "ОстатокОтправитель", , 0, ВидСравненияКомпоновкиДанных.Заполнено);
			
		КонецЕсли;
		
		МассивЭлементовХарактеристик = ОбщегоНазначенияКлиентСервер.НайтиЭлементыИГруппыОтбора(СписокХарактеристик.КомпоновщикНастроек.ФиксированныеНастройки.Отбор, "ОстатокОтправитель");
		Если МассивЭлементовХарактеристик.Количество() = 0  Тогда
			
			ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(СписокХарактеристик.КомпоновщикНастроек.ФиксированныеНастройки.Отбор, "ОстатокОтправитель", ВидСравненияКомпоновкиДанных.Заполнено, 0);
			
		Иначе
			
			ОбщегоНазначенияКлиентСервер.ИзменитьЭлементыОтбора(СписокХарактеристик.КомпоновщикНастроек.ФиксированныеНастройки.Отбор, "ОстатокОтправитель", , 0, ВидСравненияКомпоновкиДанных.Заполнено);
			
		КонецЕсли;
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(СписокЗапасы, "ОстатокОтправитель");
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(СписокХарактеристик, "ОстатокОтправитель");
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаНоменклатураИмеетсяВНаличии", "Пометка", НоменклатураИмеетсяВНаличии);
	
КонецПроцедуры // ВключитьВыключитьОтборНоменклатурыВНаличии()

#КонецОбласти

&НаСервереБезКонтекста
// Получает набор данных с сервера для процедуры НоменклатураПриИзменении.
//
Функция ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные)
	
	СтруктураДанные.Вставить("НоменклатураСтавкаНДС", Справочники.СтавкиНДС.СтавкаНДС(СтруктураДанные.Номенклатура.ВидСтавкиНДС, ?(ЗначениеЗаполнено(СтруктураДанные.Дата),СтруктураДанные.Дата, ТекущаяДатаСеанса())));
	СтруктураДанные.Вставить("ЕдиницаИзмерения", СтруктураДанные.Номенклатура.ЕдиницаИзмерения);
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеНоменклатураПриИзменении()

&НаСервереБезКонтекста
// Процедура заполняет список аналогов по переданной номенклатуре
//
Процедура ПолучитьАналогиНоменклатуры(Номенклатура, СписокАналоговНоменклатуры)
	
	СписокАналоговНоменклатуры.Очистить();
	
	Запрос = Новый Запрос("ВЫБРАТЬ * ИЗ РегистрСведений.АналогиНоменклатуры КАК Аналоги ГДЕ Номенклатура = &Номенклатура УПОРЯДОЧИТЬ ПО Приоритет");
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СписокАналоговНоменклатуры.Добавить(Выборка.Аналог);
		
	КонецЦикла;
	
	СписокАналоговНоменклатуры.Вставить(0, Номенклатура);
	
КонецПроцедуры // ПолучитьАналогиНоменклатуры()

&НаСервере
// Процедура заполняет данные объекта по переданным параметрам
// вызывается событием ПриЗаписиОбъекта, 
//
Процедура ЗаполнитьДанныеОбъекта()
	
	ЗаполнитьЗначенияСвойств(Объект, Параметры);
	
КонецПроцедуры // ЗаполнитьДанныеОбъекта()

&НаСервере
// Процедура заполняет сведения о документе вызвавшем подбор
// вызывается событием ПриЗаписиОбъекта, 
//
Процедура ЗаполнитьСведенияОДокументе(СведенияОДокументе)
	
	Обработки.ПодборПеремещение.СтруктураСведенийОДокументе(СведенияОДокументе);
	ЗаполнитьЗначенияСвойств(СведенияОДокументе, Объект);
	
КонецПроцедуры // ЗаполнитьСведенияОДокументе()

&НаСервере
// Функция помещает результаты подбора в хранилище
//
// Возвращает структуру:
//	Структура
//		- Адрес в хранилище, куда помещена выбранная номенклатура (корзина);
//		- Уникальный идентификатор формы владельца, необходим для идентификации при обработке результатов подбора;
//
Функция ЗаписатьПодборВХранилище() 
	
	КатегорииНоменклатурыСервер.УстановитьНастройкуВидОтбораНоменклатуры(ОтборИерархия);
	
	АдресКорзиныВХранилище = ПоместитьВоВременноеХранилище(Объект.КорзинаОстатокРезервХарактеристика.Выгрузить(), Объект.УникальныйИдентификаторФормыВладельца);
	Возврат Новый Структура("АдресКорзиныВХранилище, УникальныйИдентификаторФормыВладельца", АдресКорзиныВХранилище, Объект.УникальныйИдентификаторФормыВладельца);
	
КонецФункции // ЗаписатьПодборВХранилище()

&НаСервере
// Процедура устанавливает свойства элементов формы
//
Процедура УстановитьСвойстваЭлементовФормы()
	
	ПодборНоменклатурыВДокументах.УстановитьПараметрыВыбораНоменклатуры(Элементы.КорзинаОстатокРезервХарактеристикаНоменклатура, Объект.ТипНоменклатуры);
	
	ТабличныеЧасти = Новый Массив;
	ТабличныеЧасти.Добавить(СписокЗапасы);
	ПодборНоменклатурыВДокументах.ВидимостьНаборовКомплектов(ТабличныеЧасти, КешНастройкиПодбора);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокЗапасыЕдиницаИзмерения", "Видимость", ПолучитьФункциональнуюОпцию("УчетВРазличныхЕдиницахИзмерения"));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокХарактеристикЕдиницаИзмерения", "Видимость", ПолучитьФункциональнуюОпцию("УчетВРазличныхЕдиницахИзмерения"));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КорзинаОстатокРезервХарактеристикаЕдиницаИзмерения", "Видимость", ПолучитьФункциональнуюОпцию("УчетВРазличныхЕдиницахИзмерения"));
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаИзменитьВидимостьСкладскихОстатков", "Пометка", Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаИзменитьВидимостьКорзины", "Пометка", Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаОбновлятьЗаголовки", "Пометка", Истина);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаПереходНоменклатураХарактеристики", "Заголовок", НСтр("ru = 'Номенклатура'"));
	
	ВключеноРезервирование = ПолучитьФункциональнуюОпцию("РезервированиеЗапасов");
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокЗапасыРезервОтправитель", "Видимость", ВключеноРезервирование);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокЗапасыРезервПолучатель", "Видимость", ВключеноРезервирование);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КорзинаОстатокРезервХарактеристикаРезерв", "Видимость", ВключеноРезервирование);
	
	ПоказатьКоманду_ЗаполнятьКоличествоРезерва = (Объект.ВидОперации <> Перечисления.ВидыОперацийПеремещениеЗапасов.ПередачаВЭксплуатацию 
		И Объект.ВидОперации <> Перечисления.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации
		И Объект.СтруктурнаяЕдиницаОтправитель.ТипСтруктурнойЕдиницы <> Перечисления.ТипыСтруктурныхЕдиниц.Розница 
		И Объект.СтруктурнаяЕдиницаОтправитель.ТипСтруктурнойЕдиницы <> Перечисления.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет
		И ВключеноРезервирование); // Должны выполняться все условия из документа, а так же использоваться резервирование
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаЗаполнятьКоличествоРезерва", "Видимость", ПоказатьКоманду_ЗаполнятьКоличествоРезерва);
	
КонецПроцедуры // УстановитьСвойстваЭлементовФормы()

&НаКлиенте
// Процедура устанавливает переданный элемент формы текущим
//
Процедура УстановитьТекущийЭлементыФормы(Элемент)
	
	ЭтаФорма.ТекущийЭлемент = Элемент;
	
КонецПроцедуры // УстановитьТекущийЭлементыФормы()

&НаКлиенте
// Процедура вызывает форму, которая содержит совет пользователю
//
Процедура ПоказатьСоветПользователю(ЗаголовокФормы, ТекстСообщения, ВидимостьБольшеНеПоказывать, ИмяПользовательскойНастройки)
	
	ПараметрыСовета = Новый Структура;
	ПараметрыСовета.Вставить("Заголовок", ЗаголовокФормы);
	ПараметрыСовета.Вставить("ТекстСообщения", ТекстСообщения);
	ПараметрыСовета.Вставить("ВидимостьБольшеНеПоказывать", ВидимостьБольшеНеПоказывать);
	ПараметрыСовета.Вставить("ИмяПользовательскойНастройки", ИмяПользовательскойНастройки);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыводаСовета", ЭтотОбъект, ПараметрыСовета);
	ОткрытьФорму("ОбщаяФорма.ФормаСообщения", ПараметрыСовета, ЭтаФорма, Истина, , , ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры // ПоказатьСоветПользователю()

&НаКлиенте
// Процедура обработчик ожидания. Выводить совет пользователю поверх окна подбора
//
Процедура ВыводитьСоветИспользоватьПредыдущийПодбор()
	
	Если КешНастройкиПодбора.ВыводитьСоветИспользоватьПредыдущийПодбор Тогда
		
		ЗаголовокФормы = НСтр("ru = 'Совет'");
		ТекстСообщения = НСтр("ru = 'Выключить/включить использование новой формы подбора можно в настройках пользователя.'");
		
		ПоказатьСоветПользователю(ЗаголовокФормы, ТекстСообщения, Истина, "ВыводитьСоветИспользоватьПредыдущийПодбор");
		
	КонецЕсли;
	
КонецПроцедуры // ВывестиСоветОПодборе()

&НаКлиенте
// Процедура вывода совета пользователю о возврате к списку номенклатуры
//
Процедура ВыводитьСоветВернутьсяКНоменклатуре()
	
	Если КешНастройкиПодбора.ВыводитьСоветВернутьсяКНоменклатуре Тогда
		
		ЗаголовокФормы = НСтр("ru = 'Совет'");
		ТекстСообщения = НСтр("ru = 'Вернуться к списку номенклатуры можно при помощи контекстного меню или клавиши BackSpace.'");
		
		ПоказатьСоветПользователю(ЗаголовокФормы, ТекстСообщения, Истина, "ВыводитьСоветВернутьсяКНоменклатуре");
		
	КонецЕсли;
	
КонецПроцедуры // ВыводитьСоветВернутьсяКНоменклатуре()

&НаКлиенте
// Процедура управления заголовком группы отборов
//
Процедура ИзменитьЗаголовокГруппыОтборов(ОтборУстановлен)
	
	ЗаголовокДекорации = ?(ОтборУстановлен = Истина, НСтр("ru ='Отборы (установлены)'"), НСтр("ru ='Отборы'"));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаОтборы", "Заголовок", ЗаголовокДекорации);
	
КонецПроцедуры // ИзменитьЗаголовокГруппыОтборов()

&НаКлиенте
Процедура ОтборИерархияПриИзменении(Элемент)
	
	ЭтоИерархияНоменклатуры = (ОтборИерархия = ПредопределенноеЗначение("Перечисление.ВидыОтборовНоменклатуры.ГруппыНоменклатуры"));
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокИерархияНоменклатуры", "Видимость", ЭтоИерархияНоменклатуры);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокИерархияНоменклатурныхГрупп", "Видимость", НЕ ЭтоИерархияНоменклатуры);
	
КонецПроцедуры

&НаКлиенте
// Процедура обрабатывает результаты открытия дополнительной формы "Настройки"
//
Процедура ОбновитьНастройкиПодбора(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(РезультатЗакрытия) = Тип("Структура") Тогда
		
		Для Каждого ЭлементНастройки Из РезультатЗакрытия Цикл
			
			Если ЭлементНастройки.Значение <> КешНастройкиПодбора[ЭлементНастройки.Ключ] Тогда
				
				КешНастройкиПодбора[ЭлементНастройки.Ключ] = ЭлементНастройки.Значение;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры // ОбновитьНастройкиПодбора()

&НаКлиенте
// Процедура обрабатывает результаты открытия дополнительной формы "Количества"
//
//
Процедура ПослеВыбораКоличества(РезультатЗакрытия, ДанныеСтрокиКорзины) Экспорт
	
	Если ТипЗнч(РезультатЗакрытия) = Тип("Структура") Тогда
		
		Если ДанныеСтрокиКорзины.СтрокаКорзины = Неопределено Тогда
			
			СтрокаКорзины = Объект.КорзинаОстатокРезервХарактеристика.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаКорзины, ДанныеСтрокиКорзины);
			СтрокаКорзины.Количество = РезультатЗакрытия.Количество;
			
		Иначе
			
			СтрокаКорзины = Объект.КорзинаОстатокРезервХарактеристика.НайтиПоИдентификатору(ДанныеСтрокиКорзины.СтрокаКорзины);
			СтрокаКорзины.Количество = СтрокаКорзины.Количество + РезультатЗакрытия.Количество;
			
		КонецЕсли;
		
		СтрокаКорзины.Резерв	= ?(ВключеноРезервирование И ЗаполнятьКоличествоРезерва, МИН(СтрокаКорзины.Количество, ДанныеСтрокиКорзины.Свободно),0);
		
	КонецЕсли;
	
КонецПроцедуры // ПослеВыбораКоличества()

&НаКлиенте
// Процедура обрабатывает результаты открытия дополнительной формы "Сведения о документе"
//
Процедура ПослеЗакрытияФормыСведенияОДокументе(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	ПараметрыОсновнойФормыПодбора = ДополнительныеПараметры;
	
КонецПроцедуры // ПослеЗакрытияФормыСведенияОДокументе()

&НаКлиенте
// Процедура обрабатывает результаты открытия дополнительной формы "Расшифровка резерва"
//
Процедура ПослеОткрытияРасшифровкиРезерва(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	ПараметрыОсновнойФормыПодбора = ДополнительныеПараметры;
	
КонецПроцедуры // ПослеОткрытияРасшифровкиРезерва()

&НаКлиенте
// Процедура обрабатывает результаты открытия формы совета пользователю
//
Процедура ПослеВыводаСовета(РезультатЗакрытия, ПараметрыСовета) Экспорт
	
	Если ПараметрыСовета.ВидимостьБольшеНеПоказывать 
		И ТипЗнч(РезультатЗакрытия) = Тип("Структура") Тогда
		
		КешНастройкиПодбора.Вставить(ПараметрыСовета.ИмяПользовательскойНастройки, РезультатЗакрытия.ЗначениеПользовательскойНастройки);
		ПерсональныеНастройкиВызовСервера.Установить(РезультатЗакрытия.ЗначениеПользовательскойНастройки,
			ПараметрыСовета.ИмяПользовательскойНастройки);
		
	КонецЕсли;
	
КонецПроцедуры // ПослеВыводаСовета()

#КонецОбласти
